Repository: RobinNunkesser/csharp-maui-study-companion
Catalog: StudyCompanion/Resources/Strings/AppResources.*.resx
Languages: de

source: Networks
de: Netzwerke

source: Operating Systems
de: Betriebssysteme

source: Bitencodings
de: Bitcodierungen

source: Page Replacement
de: Seitenersetzung

source: Exercises
de: Übungen

source: New Values
de: Neue Werte

source: Requests
de: Folge

source: Show solution
de: Lösung anzeigen

source: Settings
de: Einstellungen

source: Schedule
de: Stundenplan

source: Courses
de: Kurse

source: Specialization
de: Vertiefung

# PricesLabel
source: Students / Staff / Guests
de: Studierende / Bedienstete / Gäste

source: Allergens
de: Allergene

# A1
source: Gluten
de: glutenhaltig

# A2
source: Shellfish and products/foods containing shellfish
de: Krebstiere und Krebstiererzeugnisse

# A3
source: Eggs and products/foods containing eggs
de: Eier und Eiererzeugnisse

# A4
source: Fish
de: Fisch

# A5
source: Peanuts and products/foods containing peanuts
de: Erdnüsse und Erdnusserzeugnisse

# A6
source: Soy and products/foods containing soy
de: Soja und Sojaerzeugnisse

# A7
source: Milk and products/foods containing milk (including lactose)
de: Milch und Milcherzeugnisse(einschließlich Lactose)

# A8
source: Nuts and products/foods containing nuts
de: Schalenfrüchte sowie daraus hergest. Erzeugnisse

# A9
source: Celery and products/foods containing celery
de: Sellerie und Sellerieerzeugnisse

# A10
source: Mustard and products/foods containing mustard
de: Senf und Senferzeugnisse

# A11
source: Sesame and products/foods containing sesame
de: Sesamsamen und Sesamsamenerzeugnisse

# A12
source: Sulfur und sulfite
de: Schwefeldioxid und Sulfite

# A13
source: Lupine and products/foods containing lupine
de: Lupinen und Lupinenerzeugnisse

# A14
source: Mollusk and products/foods containing mollusk
de: Weichtiere und Weichtiererzeugnisse

source: Additives
de: Zusatzstoffe

# Z1
source: Food coloring
de: mit Farbstoff(en)

# Z2
source: Preservatives
de: mit Konservierungsstoff(en)

# Z3
source: Antioxidants
de: mit Antioxidationsmittel

# Z4
source: Flavor enhancer
de: mit Geschmacksverstärker(n)

# Z5
source: Phosphate
de: mit Phosphat

# Z6
source: Sulphureted
de: geschwefelt

# Z7
source: Waxed
de: gewachst

# Z8
source: Blackened
de: geschwärzt

# Z9
source: Sweetener(s)
de: mit Süßungsmittel(n)

# Z10
source: Contains phenylalanine
de: enthält eine Phenylalaninquelle

# Z11
source: Taurine
de: mit Taurin

# Z12
source: Nitrite pickling salt
de: mit Nitratpökelsalz

# Z13
source: Caffeinated
de: koffeinhaltig

# Z14
source: Contains quinine
de: chininhaltig

# Z15
source: Milk protein
de: Milcheiweiß

source: Error
de: Fehler

source: Cancel
de: Abbrechen

source: Search term
de: Suchbegriff

# MensaInfo
source: Ingredients/Nutritional information is available at Studierendenwerk Paderborn's web page.
de: Weitere Informationen zu Inhaltsstoffen und Nährwerten gibt es auf der Webseite des Studierendenwerks Paderborn.

# IOSPermissions
source: Please allow calendar access in the Settings app.
de: Bitte erlaube Kalenderzugriff in der Einstellungsapp.

# PermissionRationale
source: Calendar access is needed for calendar export.
de: Kalenderzugriff wird für den Export benötigt.

source: Show
de: Anzeigen

# Maindishes
source: Dishes
de: Essen

source: Soups
de: Suppen

source: Side dishes
de: Beilagen

# NoMeals
source: No meals to display. Mensa closed?
de: Keine Essen zur Anzeige. Mensa geschlossen?

# NoCalendars
source: No editable calendars.
de: Keine editierbaren Kalender.

# ErrorMessage
source: Error while fetching the data. Please try again later.
de: Fehler beim Abrufen der Daten. Bitte später erneut probieren.

source: Right
de: Richtig

source: Wrong
de: Falsch

source: Skip
de: Überspringen

# MST
source: Minimum Spanning Tree
de: Minimaler Spannbaum

source: Shortest Paths
de: Kürzeste Wege

source: Netmasks
de: Netzmasken

source: Address
de: Adresse

source: Realtime Scheduling
de: Echtzeitscheduling

source: Processes
de: Prozesse

source: Student
de: Studierende

source: Staff
de: Bedienstete

source: Guest
de: Gäste

# CalendarExportQuery
source: Export course to calendar?
de: Veranstaltung in Kalender exportieren?

# StatusQuery
source: Choose your status at HSHL
de: Was ist Dein aktueller Status an der HSHL?

# QueryInfo
source: You can change the setting later!
de: Du kannst die Einstellung auch nachher ändern!

# InfoText_Buddy_Request
source: The process {0} requests {1} KB of memory. {2} KB are allocated for the process.
de: Der Prozess {0} fordert {1} KB an Speicher an. Dem Prozess werden {2} KB zugewiesen.

# InfoText_Buddy_Final
source: The process {0} is finished, memory is freed.
de: Der Prozess {0} wird wieder freigegeben.

# InfoText_PageReplacement_Element_Added
source: The element {0} was added in Slot {1},
de: Das Element {0} wurde in Kachel {1} eingefügt,

# InfoText_PageReplacement_Element_Added_Empty
source: because the Slot was empty.
de: da die Kachel leer stand.

# InfoText_PageReplacement_Element_Added_NotInUse
source: because the element contained in the Slot is not used anymore.
de: da das Element dieser Kachel nicht mehr genutzt wird.

# InfoText_PageReplacement_Element_Exists
source: The element is already present in Slot {0}.
de: Das Element ist bereits in Kachel {0} vorhanden.

# InfoText_PageReplacement_Fifo_Element_Added_Distance
source: because the last use of the element contained in the Slot is the furthest ({0}) in the past.
de: da die letzte Nutzung des Elementes dieser Kachel am weitesten ({0}) in der Vergangenheit lag.

# InfoText_PageReplacement_LRU_Element_Added_Distance
source: because the last use of the element contained in the Slot is the furthest ({0}) in the past.
de: da die letzte Nutzung des Elementes dieser Kachel am weitesten {0} in der Vergangenheit lag.

# InfoText_PageReplacement_Optimal_Element_Added_NotInUse
source: because the use of the element contained in the Slot is the furthest ({0}) in the future.
de: da die nächste Nutzung des Elementes dieser Kachel am weitesten ({0}) in der Zukunft lag.

# InfoText_PageReplacement_SecondChanceClock_Element_Added_NotPointer
source: The first Slot that is considered according to the pointer is Slot {0}. Because the reference bit of this Slot was 1, the bit is first set to 0, after that the next slot is considered. Slot {1} was the first Slot with a reference bit = 0, where the element could be added. Now the pointer point at Slot {2}
de: Der Zeiger bestimmt, welche Kachel zu erst betrachtet wird: Kachel {0}. Da das Referenzbit dieser Kachel = 1 war, wird dieses zunächst auf 0 gesetzt und anschließend die nächste Kachel betrachtet. Kachel {1} war die erste Kachel mit Referenzbit = 0, in welches das Element eingesetzt werden konnte. Nun zeigt der Zeiger auf: Kachel {1}

# InfoText_PageReplacement_SecondChanceClock_Element_Added_Pointer
source: The first Slot that is considered according to the pointer is Slot {0}. \n\nBecause the reference bit of this Slot was 0, the element could be added. Now the pointer point at Slot {1}.
de: Der Zeiger bestimmt, welche Kachel zu erst betrachtet wird: Kachel {0}. Da das Referenzbit dieser Kachel = 0 war, konnte das Element eingesetzt werden. Nun zeigt der Zeiger auf Kachel {1}.

# InfoText_RealTimeScheduling_EDF
source: The process {0} currently has priority according EDF, because he has the earliest deadline. \n\nIt is started, since no other process with an earlier deadline is ready.
de: Der Prozess {0} hat gemäß EDF aktuell Priorität, da er die früheste Deadline hat. Er wird gestartet, da kein anderer Prozess mit früherer Deadline rechenbereit ist.

# InfoText_RealTimeScheduling_EDF_Info
source: EDF = Earliest Deadline First The priority of a process is derived depending on the deadline of the process. The earlier the deadline, the higher of a priority is given.
de: EDF = Earliest Deadline First Die Priorität wird von der Deadline des Prozesses abgeleitet. Je früher die Deadline, desto höher die Priorität.

# InfoText_RealTimeScheduling_RMS_High
source: Because the process {0} has the highest priority according to RMS, it is executed immedeately. The process can interrupt other processes with low or medium priority.
de: Da der Prozess {0} gemäß RMS die höchste Priorität hat, wird er sofort ausgeführt. Der Prozess kann Prozesse mit niedriger und mittlerer Priorität unterbrechen.

# InfoText_RealTimeScheduling_RMS_Info
source: RMS = Rate Monotonous Scheduling The priority of a process is derived depending on how often a process appears. The more often a process appears, the higher of a priority is given.
de: RMS = Raten Monotones Scheduling Die Priorität wird von der Häufigkeit des Prozesses abgeleitet. Je häufiger ein Prozess vorkommt, desto höher wird er priorisiert.

# InfoText_RealTimeScheduling_RMS_Low
source: The process {0} has low priority according to RMS. It is executed, since no other process with a higher priority is ready. The process can be interrupted by other processes with medium or high priority.
de: Der Prozess {0} hat gemäß RMS die niedrigste Priorität. Er wird gestartet, da kein Prozess mit höherer Priorität ansteht. Der Prozess kann von einem Prozess mit mittlerer oder hoher Priorität unterbrochen werden.

# InfoText_RealTimeScheduling_RMS_Medium
source: The process {0} has medium priority according to RMS. It is executed, since no other process with a higher priority is ready. The process can interrupt other processes with low priority and be interrupted by processes with high priority.
de: Der Prozess {0} hat gemäß RMS mittlere Priorität. Er wird gestartet, da kein Prozess mit höherer Priorität ansteht. \n\nDer Prozess kann einen Prozess mit niedriger Priorität unterbrechen und von einem Prozess mit hoher Priorität unterbrochen werden.

# TableLabel_CRC_Calculation
source: Calculation
de: Berechnung

# TableLabel_CRC_Check
source: Check
de: Prüfung

# TableLabel_PageReplacement_Distance
source: Distance
de: Abstand

# TableLabel_PageReplacement_Pointer
source: Pointer
de: Zeiger

# TableLabel_PageReplacement_Reference
source: Reference
de: Referenz

# TableLabel_PageReplacement_Slot
source: Slot
de: Kachel

# MSTV_Info_1
source: The shortest path to connect
de: Der kürzeste Weg um

# MSTV_Info_2
source: with
de: mit

# MSTV_Info_3
source: is over the edge
de: zu Verbinden ist über die

# MSTV_Info_4
source: with the tag
de: Kante mit der Gewichtung

# ShortestPath_Info_1
source: The Shortest Path to
de: Der kürzeste Weg zu

# ShortestPath_Info_2
source: starting from
de: ausgehend von

# ShortestPath_Info_3
source: is available over:
de: ist zu erreichen über:

# InfoText_BitEncoding
source: NRZ: 0 = - | 1 = + NRZI: 1 = Voltage change (+/-) MLT-3: 1 = alternating +, 0 and -
de: NRZ: 0 = - | 1 = + NRZI: 1 = Spannungsveränderung (+/-) MLT-3: 1 = abwechselnd +, 0 und -

# InfoText_Scheduling_FirstComeFirstServed_Info
source: The processes are processed in order of appearance. For the total waiting time, the running time of each process is multiplied by the number of ready processes. The result is summed and divided by the number of processes.
de: Die Prozesse werden der Reihenfolge nach abgearbeitet. Für die Gesamtwartezeit wird die Laufzeit eines jeden Prozesses mit der Anzahl an bereiten Prozessen multipliziert, das Ergebnis wird summiert und durch die Anzahl der Prozesse dividiert.

# InfoText_Scheduling_Priority_Info
source: The processes are processed in order according to their priority. For the total waiting time, the runtime of each process is multiplied by the respective priority. The result is summed up and divided by the number of processes.
de: Die Prozesse werden der Reihenfolge nach entsprechend ihrer Priorität abgearbeitet. Für die Gesamtwartezeit wird die Laufzeit eines jeden Prozesses mit der jeweiligen Priorität multipliziert, das Ergebnis wird summiert und durch die Anzahl der Prozesse dividiert.

# InfoText_Scheduling_ShortestJobFirst_Info
source: The processes are processed one after another, while processes with a short runtime are prioritized. For the total waiting time, the running time of each process is multiplied by the number of processes in ready state. The sum of the result is divided by the number of processes.
de: Die Prozesse werden der Reihenfolge nach abgearbeitet, wobei Prozesse mit geringer Laufzeit priorisiert werden. Für die Gesamtwartezeit wird die Laufzeit eines jeden Prozesses mit der Anzahl an bereiten Prozessen multipliziert, das Ergebnis wird summiert und durch die Anzahl der Prozesse dividiert.

# InfoText_Scheduling_Calculation
source: Calculation
de: Berechnung

# InfoText_Scheduling_Duration
source: Duration
de: Dauer

# InfoText_Scheduling_Priority
source: Priority
de: Priorität

# InfoText_Scheduling_Result
source: Result
de: Ergebnis

# InfoText_Scheduling_RoundRobin_AfterTimeUnit
source: After {0} time unit:
de: Nach {0} Zeiteinheit:

# InfoText_Scheduling_RoundRobin_AfterTimeUnits
source: After {0} time units:
de: Nach {0} Zeiteinheiten:

# InfoText_Scheduling_RoundRobin_Begin
source: Begin:
de: Beginn:

# InfoText_Scheduling_RoundRobin_Info
source: According to the round robin method, each process in ready state is granted the same computing time. If a process is completed, the computing time each process gets is distributed again. The total wait time is the units of time it takes for each process to complete multiplied by the number of processes that are in ready state, divided by the total number of processes.
de: Nach dem Round Robin Verfahren wird jedem bereiten Prozess die selbe Rechenzeit gewährt. Wird ein Prozess vollendet, so wird die Rechenzeit erneut aufgeteilt. Die Gesamtwartezeit ergibt sich aus den Zeiteinheiten, welche es braucht, bis ein jeder Prozess vollendet ist, multipliziert mit der jeweiligen Anzahl an bereiten Prozessen, dividiert durch die Gesamtanzahl der Prozesse.

# InfoText_Scheduling_RoundRobin_WaitingTime
source: Waiting time:
de: Wartezeit:

# InfoText_CRC_check
source: The remaining bit sequence is called the check bit and can be used for the check afterwards.
de: Die übrig gebliebene Bitfolge wird als Prüfbit bezeichnet und kann im Folgenden für die Prüfung verwendet werden.

# InfoText_CRC_check_Finish
source: If the bit sequence remaining at the end is 0, the transmission was successful.
de: Ergibt die zum Schluss übrig gebliebene Bitfolge 0, so war die Übertragung erfolgreich.

# InfoText_CRC_check_Start
source: The original bit sequence {0} is extended by the check bit {1}. An XOR division is then carried out with the fixed generator polynomial 100101.
de: Die ursprüngliche Bitfolge {0} wird um das Prüfbit {1} erweitert. Anschließend wird eine XOR Division mit dem festen Generatorpolynom 100101 durchgeführt.

# InfoText_CRC_evenStep
source: An XOR division with the generator polynomial 100101 is again carried out on the resulting bit sequence.
de: Auf der resultierenden Bitfolge wird wieder eine XOR Division mit dem Generatorpolynom 100101 durchgeführt.

# InfoText_CRC_Start
source: The bit sequence {0} is extended by 5 zeros. An XOR division is then carried out with the generator polynomial 100101 (CRC5).
de: Die Bitfolge {0} wird um 5 Nullen erweitert. Anschließend wird eine XOR Division mit dem Generatorpolynom 100101 (CRC5) durchgeführt.

# InfoText_CRC_unevenStep
source: XOR division is performed: 1 over 1 equals 0 0 over 0 equals 0 1 over 0 equals 1 0 over 1 equals 1 Leading zeros can be omitted. The resulting bit string is extended back to 6 characters by pulling down the existing bits (zeros) of the bit string.
de: XOR Division wird durchgeführt: 1 über 1 ergibt 0 0 über 0 ergibt 0 1 über 0 ergibt 1 0 über 1 ergibt 1 Voranstehende Nullen können weg gelassen werden. Die resultierende Bitfolge wird wieder auf 6 Zeichen erweitert, indem die vorhandenen Bits (Nullen) der Bitfolge heruntergezogen werden.
